# 1. Назовите три способа, с помощью которых вы можете присвоить трем переменным
# одно и то же значение.
answer1 = 'построчно, тройное равенство, в одну строку'
# 2. Почему необходимо соблюдать осторожность в случае присваивания трем переменным
# изменяемого объекта?
answer2 = 'если объект изменяемый на месте, то при изменении одной переменной изменится другая'
# 3. Что не так с оператором L = L. sort () ?
answer3 = 'выводится None'
# 4. Как вы могли бы применить операцию print для отправки текста во внешний
# файл?
answer4 = 'изменить аргумент print(file = file.txt), sys.stdout = open(...), '
