# 1. Какие три элемента синтаксиса обязательны в С-подобном языке, но опущены в Python?
answer1 = ';{},()'
# 2. Как обычно завершается оператор в Python?
answer2 = 'конец строки или ; или ()'
# 3. Как операторы во вложенном блоке обычно ассоциируются в Python?
answer3 = 'Все операторы во вложенном блоке имеют отступы с одинаковым количеством табуляций или' \
          ' пробелов'
# 4. Как можно было бы разместить одиночный оператор в нескольких строках?
answer4 = '(), [], {}'
# 5. Как можно было бы записать составной оператор в одной строке?
answer5 = 'Тело составного оператора может быть перемещено в строку заголовка после двоеточия, ' \
          'но только если тело состоит из несоставных операторов'
# 6. Есть ли веские причины набирать точку с запятой в конце оператора в Python?
answer6 = 'нет'
# 7. Для чего предназначен оператор try?
answer7 = 'перехват ошибок'
# 8. Какую ошибку чаще всего допускают новички в Python?
answer8 = ': в конце строки заголовка оператора'
