# 1. Каким будет значение выражения 2 * (3 + 4) в Python?
answer1 = 14
# 2. Каким будет значение выражения 2 ★ 3 + 4 в Python?
answer2 = 10
# 3. Каким будет значение выражения 2 + 3 * 4 в Python?
answer3 = 14
# 4. Какие инструменты можно использовать для нахождения квадратного корня и
# квадрата числа?
answer4 = 'math.sqrt, **(1/2), pow(x, .5)'
# 5. Каким будет тип результата выражения 1 + 2.О + 3?
answer5 = 6.0
# 6. Как можно усекать и округлять число с плавающей точкой?
answer6 = 'int(x) | round(x)'
# 7. Как можно преобразовывать целое число в число с плавающей точкой?
answer7 = 'x/1, x+.0, float(x)'
# 8. Как можно отображать целое число в восьмеричной, шестнадцатеричной или
# двоичной форме?
answer8 = 'bin(), oct(), hex()'
# 9. Как можно преобразовывать строку восьмеричных, шестнадцатеричных или
# двоичных цифр в простое целое число?
