# 1. Как определить размер кортежа? Почему этот инструмент находится там, где он
# есть?
answer1 = 'len(tuple), len - функция, так как применяется к многим типам'
# 2. Напишите выражение, которое изменяет первый элемент в кортеже.
# В процессе кортеж (4,5,6) должен стать (1,5,6).
answer2 = (1,) + tuple()[1:]
# 3. Что принимается по умолчанию для аргумента режима обработки в вызове
# open?
answer3 = 'r'
# 4. Какой модуль вы бы использовали для сохранения объектов Python в файле без
# предварительного преобразования их в строки?
answer4 = 'json'
# 5. Как бы вы копировали сразу все части вложенной структуры?
answer5 = 'import copy, copy.deepcopy(X)'
# 6. Когда Python считает объект истинным?
answer6 = 'не пусто'
# 7. В чем заключается ваша цель?
answer7 = 'Стать инженером backend Django/Flask'
