# 1. Назовите два способа расширения встроенного объектного типа.
ans1 = 'Создать новый тип с помощью класса и переопределения магических методов или унаследовать от встроенного типа'

# 2. Для чего используются декораторы функций и классов?
ans2 = 'Используются для добавления логики, в качестве оболочек для функций и классов'

# 3. Как реализовать класс нового стиля?
ans3 = 'class A: ... автоматически наследуется от класса object'

# 4. Чем отличаются классы нового стиля от классических классов?
ans4 = 'Классические классы не наследуются от object, разный поиск по дереву (новый - MRO, классический - в глубину)'

# 5. Чем отличаются нормальные методы от статических методов?
ans5 = 'Нормальные методы требуют при объявлении специальный аргумент self, статические методы работают как обычные функции, ' \
       'но привязаны к классу'

# 6. Допустимо ли применять в коде инструменты вроде__ slots__ и super?
ans6 = 'Допустимо, если это приносит пользу в оптимизации или удобочитаемости'

# 7. Сколько нужно выждать, прежде чем бросать “Пресвятую Антиохийскую
# Гранату?
ans7 = 'joke'
