# 1. Что такое множественное наследование?
ans1 = 'Когда у одного класса несколько суперклассов'

# 2. Что такое делегирование?
ans2= 'Помещение объекта внутрь промежетучного класса, который добавляет доп поведение и передает остальные операции внутреннему объекту'

# 3. Что такое композиция?
ans3 = 'Когда один объект содержит несколько'

# 4. Что такое связанные методы?
ans4 = 'Методы, которые вызываются через обращение к экземпляру'

# 5. Для чего используются псевдозакрытые атрибуты?
ans5 = 'Для того, чтобы не было конфликта имен'
