# 1. Что такое абстрактный суперкласс?
ans1 = 'Класс, который вызывает метод, но не наследует и не определяет его, а ожидает заполнения метода подклассом'

# 2. Что происходит, когда простое присваивание появляется на верхнем уровне
# оператора class?
ans2 = 'Присоединение атрибута к классу'

# 3. Почему в классе может возникнуть потребность в ручном вызове метода
# __ init__ суперкласса?
ans3 = 'Если нужно дополнительно вызвать __init__ суперкласса'

# 4. Как можно дополнить унаследованный метод, не замещая его полностью?
ans4 = 'Вызвать метод суперкласса'

# 5. Чем локальная область видимости класса отличается от локальной области видимости функции?
ans5 = 'Не служит для добавочного вложенного кода'

# 6. Какой город был столицей Ассирии?
ans6 = 'Ниневия'