# 1. В чем смысл написания функций?
answer1 = 'универсализировать и оптимизировать код'
# 2. В какой момент Python создает функцию?
answer2 = 'при достижении def'
# 3. Что функция возвращает, если в ней нет ни одного оператора return?
answer3 = 'None'
# 4. Когда выполняется код, вложенный внутрь оператора определения функции?
answer4 = 'при вызове функции'
# 5. Что не так с проверкой типов объектов, передаваемых в функцию?
answer5 = 'интерфейс функции - набор методов и операций выражений, выполняемых кодом' \
          'функции, уничтожает гибкость кода'
import chapter_17_scope

print(chapter_17_scope.a)
