# 1. Каковы главные функциональные отличия между while и for?
answer1 = 'for - количество итераций задается длиной итерируемого объекта, ' \
          'while - количество итераций зависит от условия в начала цикла'
# 2. В чем разница между break и continue?
answer2 = 'break - выводит за тело цикла, continue - переводит в начала цикла'
# 3. Когда выполняется конструкция else цикла?
answer3 = 'после завершения цикла, без break'
# 4. Как можно записать цикл с подсчетом в Python?
answer4 = 'for i in range'
# 5. Для чего может применяться range в цикле for?
answer5 = 'в for для фиксированного числа итераций, для пропуска элементов и для изменения списка ' \
          'во время цикла'
