# 1. Как связаны циклы for и итерируемые объекты?
answer1 = 'for получает итерируемый объект и применяет метод .__next__() + перехватывает исключение'
# 2. Как связаны циклы for и списковые включения?
answer2 = 'оба итерационные инструменты и контексты'
# 3. Назовите четыре итерационных контекста в языке Python.
answer3 = 'for, списковые включения, list, tuple, join, sum, all, any, sorted'
# 4. Каков наилучший способ чтения текстового файла строка за строкой на сегодняшний день?
answer4 = 'for line in open("file.txt")'
# 5. Что за оружие вы ожидали бы увидеть у испанской инквизиции?
answer5 = 'joke'
