# 1. Каким образом вы будете создавать модуль?
ans1 = 'Поместить операторы Python в текстовый файл'

# 2. Как оператор from связан с import?
ans2 = 'from выполняет операцию с import, копирует атрбиуты из импортированного модуля и присваивает идентичные имена ' \
       'из текущего модуля к этим атрибутам, после чего удаляет импортированный модуль'

# 3. Как функция reload связана с операциями импортирования?
ans3 = 'reload заставляет выполниться код из импортированного модуля, после чего обновляются все атрибуты импортированного модуля'

# 4. Когда вы обязаны использовать import вместо from?
ans4 = 'При конфликте имен'

# 5. Назовите три потенциальных затруднения, связанных с оператором from.
ans5 = 'не работает функция reload, могут быть изменены переменные текущего файла, делает неясным смысл переменных'

# 6. Шутка
ans6 = 'Шутка'