# 1. Назовите четыре основных типа данных Python.
answer1 = 'lists', 'dicts', 'tuples', 'strings', 'numbers'
# 2. Почему они называются “основными” типами данных?
answer2 = 'Являются частью Python и всегда доступны'
# 3. Что означает “неизменяемость”, и какие три основных типа Python считаются
# неизменяемыми?
answer3 = 'Данный тип данных нельзя изменить, можно только на его основе создать новый',
'tuples, strings, numbers'
# 4. Что означает “последовательность”, и какие три типа входят в эту категорию?
answer4 = 'Последовательность - упорядоченный набор элементов, которые можно итерировать',
'lists, strings, tuples'
# 5. Что означает “отображение”, и какой основной тип является отображением?
answer5 = 'Отображение - связь ключа и значения', 'dicts'
# 6. Что такое “полиморфизм” и почему о нем нужно заботиться?
answer6 = 'Полиморфизм - различное примение одинаковых методов к разным типам данных'
