# 1. Можно ли использовать строковый метод find для поиска в списке?
answer1 = False
# 2. Можно ли применять выражение среза строки для списка?
answer2 = True
# 3. Как бы вы преобразовали символ в его целочисленный код ASCII? Как бы вы
# выполнили обратное преобразование из целого числа в символ?
answer3 = ord('s') and chr(2)
# 4. Как бы вы могли изменить строку в Python?
answer4 = 'неизменямы'
# 5. Для заданной строки S со значением "s,pa,in" назовите два способа извлечения
# двух символов из середины строки.
answer5 = str.split('') or str[2:4]
# 6. Сколько символов имеется в строке "a\nb\xlf\000d"?
answer6 = 6
# 7. Почему вы использовали бы модуль string вместо вызова строковых методов?
answer7 = 'это старый метод'
